STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA52CG/Applications/BLE/BLE_DataThroughput_Server/STM32_WPAN/App/app_ble.c
        /* USER CODE END EVT_DISCONN_COMPLETE_2 */
      }

      gap_cmd_resp_release();

      /* USER CODE BEGIN EVT_DISCONN_COMPLETE_1 */

      Adv_Request(APP_BLE_ADV_FAST);
      /* USER CODE END EVT_DISCONN_COMPLETE_1 */
      DT_SERVHandleNotification.EvtOpcode = DT_SERV_DISCON_HANDLE_EVT;
      DT_SERVHandleNotification.ConnectionHandle = p_disconnection_complete_event->Connection_Handle;
      DT_SERV_APP_EvtRx(&DT_SERVHandleNotification);
      /* USER CODE BEGIN EVT_DISCONN_COMPLETE */

      /* USER CODE END EVT_DISCONN_COMPLETE */
      break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */
    }

    case HCI_LE_META_EVT_CODE:
    {
      p_meta_evt = (evt_le_meta_event*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_LE_META_EVENT */
      tBleStatus status;
      /* USER CODE END EVT_LE_META_EVENT */
      switch (p_meta_evt->subevent)
      {
        case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
        {
          hci_le_connection_update_complete_event_rp0 *p_conn_update_complete;
          p_conn_update_complete = (hci_le_connection_update_complete_event_rp0 *) p_meta_evt->data;
          APP_DBG_MSG(">>== HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE\n");
          APP_DBG_MSG("     - Connection Interval:   %.2f ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n",
                       p_conn_update_complete->Conn_Interval*1.25,
                       p_conn_update_complete->Conn_Latency,
                       p_conn_update_complete->Supervision_Timeout*10);
          UNUSED(p_conn_update_complete);
          /* USER CODE BEGIN EVT_LE_CONN_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_CONN_UPDATE_COMPLETE */
          break;
        }
        case HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE:
        {
          hci_le_phy_update_complete_event_rp0 *p_le_phy_update_complete;
          p_le_phy_update_complete = (hci_le_phy_update_complete_event_rp0*)p_meta_evt->data;
          UNUSED(p_le_phy_update_complete);

          gap_cmd_resp_release();

          /* USER CODE BEGIN EVT_LE_PHY_UPDATE_COMPLETE */
          if (p_le_phy_update_complete->Status == 0)
          {
            APP_DBG_MSG(">>== UPDATE PHY COMPLETE SUCCESS \n");
            APP_DBG_MSG(">>== TX PHY =  %d RX_PHY =  %d ", p_le_phy_update_complete->TX_PHY, p_le_phy_update_complete->RX_PHY);
            APP_DBG_MSG("\r\n\r");
          }
          else
          {
            APP_DBG_MSG(">>== UPDATE PHY COMPLETE FAILED %d \n", p_le_phy_update_complete->Status);
          }            
          /* USER CODE END EVT_LE_PHY_UPDATE_COMPLETE */
          break;
        }
        case HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          hci_le_enhanced_connection_complete_event_rp0 *p_enhanced_conn_complete;
          p_enhanced_conn_complete = (hci_le_enhanced_connection_complete_event_rp0 *) p_meta_evt->data;

          APP_DBG_MSG(">>== HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE - Connection handle: 0x%04X\n", p_enhanced_conn_complete->Connection_Handle);
          APP_DBG_MSG("     - Connection established with @:%02x:%02x:%02x:%02x:%02x:%02x\n",
                      p_enhanced_conn_complete->Peer_Address[5],
                      p_enhanced_conn_complete->Peer_Address[4],
                      p_enhanced_conn_complete->Peer_Address[3],
                      p_enhanced_conn_complete->Peer_Address[2],
                      p_enhanced_conn_complete->Peer_Address[1],
                      p_enhanced_conn_complete->Peer_Address[0]);
          APP_DBG_MSG("     - Connection Interval:   %.2f ms\n     - Connection latency:    %d\n     - Supervision Timeout: %d ms\n",
                      p_enhanced_conn_complete->Conn_Interval * 1.25,
                      p_enhanced_conn_complete->Conn_Latency,
                      p_enhanced_conn_complete->Supervision_Timeout * 10
                     );

          if (bleAppContext.Device_Connection_Status == APP_BLE_LP_CONNECTING)
          {
            /* Connection as client */
            bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
          }
          else
          {
            /* Connection as server */
            bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
          }
          bleAppContext.BleApplicationContext_legacy.connectionHandle = p_enhanced_conn_complete->Connection_Handle;

          DT_SERVHandleNotification.EvtOpcode = DT_SERV_CONN_HANDLE_EVT;
          DT_SERVHandleNotification.ConnectionHandle = p_enhanced_conn_complete->Connection_Handle;
          DT_SERV_APP_EvtRx(&DT_SERVHandleNotification);

          /* USER CODE BEGIN HCI_EVT_LE_ENHANCED_CONN_COMPLETE */
          DT_SERVHandleNotification.EvtOpcode = DT_SERV_CONN_HANDLE_EVT;
          DT_SERVHandleNotification.ConnectionHandle = bleAppContext.BleApplicationContext_legacy.connectionHandle;
          DT_SERV_APP_EvtRx(&DT_SERVHandleNotification);
		  /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */
          UTIL_TIMER_Stop(&(bleAppContext.Advertising_mgr_timer_Id));
          /* USER CODE END HCI_EVT_LE_ENHANCED_CONN_COMPLETE */
          break; /* HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE */
        }
        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          hci_le_connection_complete_event_rp0 *p_conn_complete;
          p_conn_complete = (hci_le_connection_complete_event_rp0 *) p_meta_evt->data;

          APP_DBG_MSG(">>== HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE - Connection handle: 0x%04X\n", p_conn_complete->Connection_Handle);
          APP_DBG_MSG("     - Connection established with @:%02x:%02x:%02x:%02x:%02x:%02x\n",
                      p_conn_complete->Peer_Address[5],
                      p_conn_complete->Peer_Address[4],
                      p_conn_complete->Peer_Address[3],
                      p_conn_complete->Peer_Address[2],
                      p_conn_complete->Peer_Address[1],
                      p_conn_complete->Peer_Address[0]);
          APP_DBG_MSG("     - Connection Interval:   %.2f ms\n     - Connection latency:    %d\n     - Supervision Timeout: %d ms\n",
                      p_conn_complete->Conn_Interval * 1.25,
                      p_conn_complete->Conn_Latency,
                      p_conn_complete->Supervision_Timeout * 10
                     );

          if (bleAppContext.Device_Connection_Status == APP_BLE_LP_CONNECTING)
          {
            /* Connection as client */
            bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
          }
          else
          {
            /* Connection as server */
            bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
          }
          bleAppContext.BleApplicationContext_legacy.connectionHandle = p_conn_complete->Connection_Handle;

          DT_SERVHandleNotification.EvtOpcode = DT_SERV_CONN_HANDLE_EVT;
          DT_SERVHandleNotification.ConnectionHandle = p_conn_complete->Connection_Handle;
          DT_SERV_APP_EvtRx(&DT_SERVHandleNotification);

          /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE */

          DT_SERVHandleNotification.EvtOpcode = DT_SERV_CONN_HANDLE_EVT;
          DT_SERVHandleNotification.ConnectionHandle = bleAppContext.BleApplicationContext_legacy.connectionHandle;
          DT_SERV_APP_EvtRx(&DT_SERVHandleNotification);

          status = aci_gatt_exchange_config(bleAppContext.BleApplicationContext_legacy.connectionHandle);
          if (status != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("  Fail   : change MTU 0x%x\n", status);
          }
          else
          {
            APP_DBG_MSG("  Success: change MTU \n");
          }

